sabre_docs/OTA_AirScheduleLLS2.2.0RQ/OTA_AirScheduleLLS2.2.0RQ.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:sws_xsd="http://webservices.sabre.com/sabreXML/2011/10" xmlns:sws="https://webservices.sabre.com/websvc" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" targetNamespace="https://webservices.sabre.com/websvc">
	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://webservices.sabre.com/sabreXML/2011/10" schemaLocation="OTA_AirScheduleLLS2.2.0RQRS.xsd"/>
			<xsd:import namespace="http://www.ebxml.org/namespaces/messageHeader" schemaLocation="msg-header-2_0.xsd"/>
			<xsd:import namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" schemaLocation="wsse.xsd"/>
			<xsd:import namespace="http://services.sabre.com/STL/v01" schemaLocation="STL_For_SabreProtocol_v.1.2.0.xsd"/>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="OTA_AirScheduleInput">
		<wsdl:part name="header" element="eb:MessageHeader"/>
		<wsdl:part name="header2" element="wsse:Security"/>
		<wsdl:part name="body" element="sws_xsd:OTA_AirScheduleRQ"/>
	</wsdl:message>
	<wsdl:message name="OTA_AirScheduleOutput">
		<wsdl:part name="header" element="eb:MessageHeader"/>
		<wsdl:part name="header2" element="wsse:Security"/>
		<wsdl:part name="body" element="sws_xsd:OTA_AirScheduleRS"/>
	</wsdl:message>
	<wsdl:portType name="OTA_AirSchedulePortType">
		<wsdl:operation name="OTA_AirScheduleRQ">
			<wsdl:input message="sws:OTA_AirScheduleInput"/>
			<wsdl:output message="sws:OTA_AirScheduleOutput"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="OTA_AirScheduleSoapBinding" type="sws:OTA_AirSchedulePortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="OTA_AirScheduleRQ">
			<soap:operation soapAction="OTA_AirScheduleLLSRQ"/>
			<wsdl:input>
				<soap:header message="sws:OTA_AirScheduleInput" part="header" use="literal"/>
				<soap:header message="sws:OTA_AirScheduleInput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:header message="sws:OTA_AirScheduleOutput" part="header" use="literal"/>
				<soap:header message="sws:OTA_AirScheduleOutput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="OTA_AirScheduleService">
		<wsdl:port name="OTA_AirSchedulePortType" binding="sws:OTA_AirScheduleSoapBinding">
			<soap:address location="https://webservices.platform.sabre.com/websvc"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
